<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"0ca56dd7bd62800f90a79f7394bb92f47aec0eef163af2f0968dba4844deb0a6","plan_job_ref":"Job Create terraform plan #39 at https://github.com/presentium/infrastructure/actions/runs/10308548835","plan_out_hash":"a20098404807c94ceb0262d2fe7357130c6ea99609d2d14085a206922f589504","plan_hash":"3b462a659c9f91e0f4a8d82c6c8b0378b2c71530d239b3f7c0a307dde879f79b","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan in __applications__
<details>
<summary>Plan: 6 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.authentik.authentik_application.presentium will be created
+   resource "authentik_application" "presentium" {
+       id                 = (known after apply)
+       meta_icon          = "https://avatars.githubusercontent.com/u/174350723?s=4000&v=4"
+       name               = "Presentium"
+       open_in_new_tab    = false
+       policy_engine_mode = "any"
+       protocol_provider  = (known after apply)
+       slug               = "presentium"
+       uuid               = (known after apply)
    }

  # module.authentik.authentik_group.admins will be created
+   resource "authentik_group" "admins" {
+       attributes   = jsonencode({})
+       id           = (known after apply)
+       is_superuser = true
+       name         = "Presentium Admins"
+       parent       = (known after apply)
+       users        = (known after apply)
    }

  # module.authentik.authentik_group.students will be created
+   resource "authentik_group" "students" {
+       attributes   = jsonencode({})
+       id           = (known after apply)
+       is_superuser = false
+       name         = "Presentium Students"
+       users        = (known after apply)
    }

  # module.authentik.authentik_group.teachers will be created
+   resource "authentik_group" "teachers" {
+       attributes   = jsonencode({})
+       id           = (known after apply)
+       is_superuser = false
+       name         = "Presentium Teachers"
+       parent       = (known after apply)
+       users        = (known after apply)
    }

  # module.authentik.authentik_provider_oauth2.presentium will be created
+   resource "authentik_provider_oauth2" "presentium" {
+       access_code_validity       = "minutes=1"
+       access_token_validity      = "**********"
+       authorization_flow         = "290749bc-bb81-4e16-b1d1-dfcc079ab6c9"
+       client_id                  = "************************************"
+       client_secret              = (sensitive value)
+       client_type                = "confidential"
+       id                         = (known after apply)
+       include_claims_in_id_token = true
+       issuer_mode                = "per_provider"
+       name                       = "oidc-presentium"
+       property_mappings          = (known after apply)
+       redirect_uris              = [
+           "https://app.presentium.ch/auth/oidc/callback",
+           "https://staging.presentium.ch/auth/oidc/callback",
+           "https://dashboard-presentium.nuxt.dev/auth/oidc/callback",
+           "https://[\\w-]+.dashboard-1as.pages.dev/auth/oidc/callback",
        ]
+       refresh_token_validity     = "*******"
+       sub_mode                   = "hashed_user_id"
    }

  # module.authentik.authentik_scope_mapping.scope-roles will be created
+   resource "authentik_scope_mapping" "scope-roles" {
+       expression = <<-EOT
            roles = []
            if ak_is_group_member(request.user, name="Presentium Students"):
              roles.append("student")
            if ak_is_group_member(request.user, name="Presentium Teachers"):
              roles.append("teacher")
            if ak_is_group_member(request.user, name="Presentium Admins"):
              roles.append("admin")
            
            return {
              "roles": roles
            }
        EOT
+       id         = (known after apply)
+       name       = "Presentium Roles"
+       scope_name = "roles"
    }

Plan: 6 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Create terraform plan #39](https://github.com/presentium/infrastructure/actions/runs/10308548835)